Feature: Запазване на час
  Scenario: Запазване на час без регистрацията
    Given Отваряме екрана за запазване на часове
    When Избираме налична дата и час
    And Въвеждаме име: "nikolay"
    And Въвеждаме фамилия: "pleshkov"
    And Въвеждаме имейл: "stu2001321014@uni-plovdiv.bg"
    And Въвеждаме телефонен номер: "359887743456"
    And Натистем бутона за запазване на час
    Then Виждаме съобщение "Успешно запазване на час"
    And Получаваме имейл за потвърждение

  Scenario: Зпазване на час когато вече имаме запазен
    Given Отваряме екрана за запазване на часове
    And Имаме запазен час
    When Избираме налична дата и час
    And Въвеждаме име: "nikolay"
    And Въвеждаме фамилия: "pleshkov"
    And Въвеждаме имейл: "stu2001321014@uni-plovdiv.bg"
    And Въвеждаме телефонен номер: "359887743456"
    And Натистем бутона за запазване на час
    Then Виждаме съобщение "Вече имате запазен час"
    And Часът не е запазен успешно

  Scenario: Запазване на много часове с един и същи имейл
    Given Отваряме екрана за запазване на часове
    And Имаме вече запазен час със съществуващ имейл
    When Избираме налична дата и час
    And Въвеждаме име: "nikolay"
    And Въвеждаме фамилия: "pleshkov"
    And Въвеждаме имейл: "stu2001321014@uni-plovdiv.bg"
    And Въвеждаме телефонен номер: "359887743456"
    And Натистем бутона за запазване на час
    Then Виждаме съобщение "Вече има запазен час с този имейл"
    And Часът не е запазен успешно

  Scenario: Запазване на час с непълна информация
    Given Отваряме екрана за запазване на часове
    When Избираме налична дата и час
    And Въвеждаме име: "nikolay"
    And Въвеждаме телефонен номер: "359887743456"
    And Натистем бутона за запазване на час
    Then Виждаме съобщение "Трябва да въведете валидна информация за вас"
    And Часът не е запазен успешно

  Scenario: Проверка на валидни дати
    Given Отваряме екрана за запазване на часове
    When Избираме налична дата и час
    Then Виждаме лист с налични дати

