Feature: Потвърждаване на запазения час
  Scenario: Потвърждаване на запазената срещата с валиден код за потвърждение
    Given  Получили сме код за потвърждение
    When  Въведем правилния код за потвърждение
    Then  Виждаме съобщение за потвърден час "Успешно потвърден час"
    And  Маркиме срещата като потвърдена

  Scenario: Провекра за невалиден код
    Given  Получили сме код за потвърждение
    When  Въведем неправилния код за потвърждение
    Then  Виждаме съобщение за грешен код "Грешен код за потвърждение"

  Scenario: Потвърждение на срещата няколко пъти
    Given  Получили сме код за потвърждение
    And  Имаме потвърдена среща
    When  Въведем код за потвърждение
    Then  Виждаме за вече потвърдена среща "Вече имате потвърдена среща"

  Scenario: Опит за потвърждение на среща без въвеждане на код за потвърждение
    Given  Получили сме код за потвърждение
    When Изпращаме формуляра без да въвеждаме код
    Then  Виждаме съобщение за невалиден код "Въведете валиден код"

  Scenario: Изпращане кода за потвърждение отново
    Given  Не сме получили код за потвърждение
    When  Избираме повторно изпращане на кода за потвърждение
    Then  Получаваме код за потвърждение на имейла